app/controllers/site_controller.rb

SELECT * FROM `players` WHERE (`players`.`name` = 'todd' AND `players`.`password` = 'pass') LIMIT 1
---
  def login
    if request.post?
      player = Player.find_by_name_and_password params[:player][:name], params[:player][:password]

SELECT * FROM `players` WHERE (`players`.`id` = 1)
---
  def discard
    player = Player.find session[:id]