app/controllers/site_controller.rb

SELECT * FROM `players` WHERE (`players`.`id` = 528)
---
  def draw
    player = Player.find session[:id]

SELECT * FROM `players` WHERE (`players`.game_id = 157)
UPDATE `players` SET `game_id` = 157, `seat_order` = 0 WHERE `id` = 524
---
  def waiting
    player = Player.find session[:id]
    player.start_new_game
    player.save

SELECT * FROM `players` WHERE (`players`.`id` = 524)
SELECT count(*) AS count_all FROM `players` WHERE (`players`.game_id = 157)
---
  def start_game
    player = Player.find(session[:id])
    game = player.game

    if (game.players.size == 4)